![png](book_core.png)

In [1]:
# imports
import pandas as pd
import pymysql
pymysql.install_as_MySQLdb()
from urllib.parse import quote_plus as urlquote
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists

In [2]:
connection = f"mysql+pymysql://{'root'}:{urlquote('nourtafa123')}@localhost/book"
# create engine
engine = create_engine(connection)

In [3]:
if database_exists(connection):
    print('It exists!')
else:
    create_database(connection)
    print("The database created!")

It exists!

In [4]:
users=pd.read_csv("users.csv")

In [5]:
users.head()

   id first_name  last_name                 email
0   1       John        Doe          JD@books.com
1   2      Robin      Smith       Robin@books.com
2   3     Gloria  Rodriguez  grodriquez@books.com

In [6]:
users.to_sql('users', engine, if_exists = 'replace')

3

In [7]:
books=pd.read_csv("books.csv")

In [8]:
books.head()

   id                 title  author_id
0   1           The Shining          1
1   2                    It          1
2   3      The Great Gatsby          2
3   4  The Call of the Wild          3
4   5   Pride and Prejudice          4

In [9]:
books.to_sql('books', engine, if_exists = 'replace')

6

In [10]:
authors=pd.read_csv("author.csv")

In [11]:
authors.head()

   id        author_name
0   1       Stephen King
1   2  F.Scott Fitgerald
2   3        Jack London
3   4        Jane Austen
4   5       Mary Shelley

In [12]:
authors.to_sql('authors', engine, if_exists = 'replace')

5

In [13]:
favorites=pd.read_csv("favorites.csv")

In [14]:
favorites.head()

   user_id  book_id
0        1        1
1        1        2
2        1        3
3        2        4
4        2        5

In [15]:
favorites.to_sql('favorites', engine, if_exists = 'replace')

7

In [16]:
q = """SHOW TABLES;"""
pd.read_sql(q,engine)

  Tables_in_book
0        authors
1          books
2      favorites
3          users

In [17]:
q= """SELECT books.title, favorites.user_id
FROM books
JOIN favorites ON books.id = favorites.book_id
WHERE favorites.user_id = 
    (SELECT users.id FROM users WHERE (users.last_name = "Doe" AND users.first_name = "John"));"""

In [18]:
pd.read_sql(q,engine)

              title  user_id
0       The Shining        1
1                It        1
2  The Great Gatsby        1